## Slicing and Indexing DataFrames

#### Slicing in both directions

You've seen slicing DataFrames by rows and by columns, but since DataFrames are two-dimensional objects, it is often natural to slice both dimensions at once. That is, by passing two arguments to `.loc[]`, you can subset by rows and columns in one go.
`pandas` is loaded as `pd`.
`temperatures_srt` is indexed by country and city, has a sorted index, and is available.

In [1]:
# importing pandas
import pandas as pd

# importing sales dataset
temperatures = pd.read_csv("../datasets/temperatures.csv")
temperatures_srt = temperatures.set_index(["country", "city"]).sort_index()
temperatures_srt.head()

                   Unnamed: 0        date  avg_temp_c
country     city
Afghanistan Kabul        7260  2000-01-01       3.326
            Kabul        7261  2000-02-01       3.454
            Kabul        7262  2000-03-01       9.612
            Kabul        7263  2000-04-01      17.925
            Kabul        7264  2000-05-01      24.658

### Instructions

* Use `.loc[]` slicing to subset rows from India, Hyderabad to Irag, Baghdad.
* Use `.loc[]` slicing to subset columns from `date` to `avg_temp_c`.
* Slice in both directions at once from Hyderabad to Baghdad, and `date` to `avg_temp_c`

In [2]:
# Subset rows from India, Hyderabad to Iraq, Baghdad
temperatures_srt.loc[("India", "Hyderabad"):("Iraq", "Baghdad")]

                   Unnamed: 0        date  avg_temp_c
country city
India   Hyderabad        5940  2000-01-01      23.779
        Hyderabad        5941  2000-02-01      25.826
        Hyderabad        5942  2000-03-01      28.821
        Hyderabad        5943  2000-04-01      32.698
        Hyderabad        5944  2000-05-01      32.438
...                       ...         ...         ...
Iraq    Baghdad          1150  2013-05-01      28.673
        Baghdad          1151  2013-06-01      33.803
        Baghdad          1152  2013-07-01      36.392
        Baghdad          1153  2013-08-01      35.463
        Baghdad          1154  2013-09-01         NaN

[2145 rows x 3 columns]

In [3]:
# Subset columns from date to avg_temp_c
temperatures_srt.loc[:, "date":"avg_temp_c"]

                          date  avg_temp_c
country     city
Afghanistan Kabul   2000-01-01       3.326
            Kabul   2000-02-01       3.454
            Kabul   2000-03-01       9.612
            Kabul   2000-04-01      17.925
            Kabul   2000-05-01      24.658
...                        ...         ...
Zimbabwe    Harare  2013-05-01      18.298
            Harare  2013-06-01      17.020
            Harare  2013-07-01      16.299
            Harare  2013-08-01      19.232
            Harare  2013-09-01         NaN

[16500 rows x 2 columns]

In [4]:
# Subset in both directions at once
temperatures_srt.loc[("India", "Hyderabad"):("Iraq", "Baghdad"), "date":"avg_temp_c"]

                       date  avg_temp_c
country city
India   Jaipur   2000-01-01      16.837
        Jaipur   2000-02-01      17.592
        Jaipur   2000-03-01      23.932
        Jaipur   2000-04-01      32.219
        Jaipur   2000-05-01      34.423
...                     ...         ...
Iraq    Baghdad  2013-05-01      28.673
        Baghdad  2013-06-01      33.803
        Baghdad  2013-07-01      36.392
        Baghdad  2013-08-01      35.463
        Baghdad  2013-09-01         NaN

[1980 rows x 2 columns]

In [6]:
# Subset rows from Pakistan, Lahore to Russia, Moscow
temperatures_srt.loc[("Pakistan", "Lahore"):("Russia", "Moscow")]

                 Unnamed: 0        date  avg_temp_c
country  city
Pakistan Lahore        8415  2000-01-01      12.792
         Lahore        8416  2000-02-01      14.339
         Lahore        8417  2000-03-01      20.309
         Lahore        8418  2000-04-01      29.072
         Lahore        8419  2000-05-01      34.845
...                     ...         ...         ...
Russia   Moscow       10885  2013-05-01      16.152
         Moscow       10886  2013-06-01      18.718
         Moscow       10887  2013-07-01      18.136
         Moscow       10888  2013-08-01      17.485
         Moscow       10889  2013-09-01         NaN

[660 rows x 3 columns]